artillery-tests/offer-feed.yml
config:
  target: "http://localhost:5001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warmup"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
  ensure:
    p95: 250
    maxErrorRate: 1

scenarios:
  - name: "Offer feed"
    weight: 50
    flow:
      - get:
          url: "/api/offers"
          expect:
            - statusCode: 200

  - name: "Offer feed with category"
    weight: 30
    flow:
      - get:
          url: "/api/offers?category=food-dining&page=1&limit=20"
          expect:
            - statusCode: 200

  - name: "Homepage offers"
    weight: 20
    flow:
      - get:
          url: "/api/homepage"
          expect:
            - statusCode: 200